#!/usr/bin/python
# -*- coding: utf8 -*-

import sys
import os

print("実行中のスクリプトファイルの相対パス\n")
print("__file__ :%s" %  __file__) 
print("sys.argv[0] :%s" %  sys.argv[0])
print("\n======================================================================================")


print("\nいま実行中のスクリプトファイルの配置先ディレクトリの相対パスを表示します。\n")
print("os.path.dirname(__file__) : %s" % os.path.dirname(__file__))
print("\n======================================================================================")


print("\nいま実行中のスクリプトファイルのファイル名を表示します。\n")
print("os.path.basename(__file__) :%s" % os.path.basename(__file__))

print("\n======================================================================================")
print("\nいま実行中のスクリプトファイルの絶対パスを表示します。\n")
print("os.path.abspath(__file__) :%s" % os.path.abspath(__file__))


print("\n======================================================================================")
print("\nいま実行中のスクリプトファイルの配置先ディレクトリの絶対パスを表示します。\n")
print("os.path.abspath(os.path.dirname(__file__)) :%s" % os.path.abspath(os.path.dirname(__file__)))

print("\n======================================================================================")
print("\nいまスクリプトを実行しているカレントディレクトリの絶対パスを表示します。\n")
print("os.getcwd() : %s \n" % os.getcwd())

